## MERGE

In [5]:
## Ortak bir sütunları olan iki dataframe i birleştirmek için kullanılabilir
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

In [2]:
dic1 = {"İsim" : ["Ahmet", "Mehmet", "Zeynep", "Orhan"], "Spor": ["Koşu", "Yüzme","Basketbol", "Futbol"]}

In [3]:
dic2= {"İsim" : ["Ahmet", "Mehmet", "Zeynep", "Orhan"],
        "Kalori": [100,200,350,220]}

In [6]:
frame1 = pd.DataFrame(data= dic1)

In [7]:
frame2 = pd.DataFrame(data= dic2)

In [8]:
frame1

     İsim       Spor
0   Ahmet       Koşu
1  Mehmet      Yüzme
2  Zeynep  Basketbol
3   Orhan     Futbol

In [9]:
frame2

     İsim  Kalori
0   Ahmet     100
1  Mehmet     200
2  Zeynep     350
3   Orhan     220

In [10]:
mergedDataframe = pd.merge(frame1,frame2, on = "İsim")

## Burada İsim ortak kolon olduğu için on =" İsim " şeklinde bir metot var

In [11]:
mergedDataframe

     İsim       Spor  Kalori
0   Ahmet       Koşu     100
1  Mehmet      Yüzme     200
2  Zeynep  Basketbol     350
3   Orhan     Futbol     220